[
  {
    "url": "https://www.channelnewsasia.com/singapore/february-bto-exercise-tampines-most-popular-5923061",
    "title": "February BTO exercise: Shorter waiting time projects in Tampines attract most applications",
    "section": null,
    "subtitle": "Singapore",
    "location": "SINGAPORE",
    "body_content": "As of 5pm on Wednesday, more than 14,000 applications were received in the first Build-to-Order sales exercise of the year. An artist's impression of Tampines Nova, which will offer two-room Flexi and four-room flats with a wait time of two years and eight months. (Image: Housing and Development Board) The ongoing Build-to-Order (BTO) sales exercise for February has drawn 14,052 applications as of 5pm on Wednesday (Feb 11), with the projects in Tampines attracting the most applications. The first BTO exercise of the year began on Feb 4 and runs until 11.59pm on Wednesday. The final numbers will be published at 2pm on Thursday. In total, 4,692 flats were launched across six projects in Toa Payoh, Bukit Merah, Sembawang and Tampines. Tampines was the most sought-after estate, with 337 four-room flats attracting 3,260 applicants, recording an application rate of 6.8 for first-timer families and 35.8 for second-timer families. The town had two projects in the February sales exercise. Tampines Bliss is classified as a Standard project, while Tampines Nova is classified as a Plus project. Ms Christine Sun, chief researcher and strategist of Realion (OrangeTee & ETC) Group, said the results align with expectations that the town would be the most popular. “Tampines Nova is situated right at the heart of Tampines Central, and such plum sites are rare, given the scarcity of land for new development in the Tampines Central area,” she said, adding that the preschool integrated within the development is a “unique feature”. Both projects have shorter waiting times of under three years: Tampines Bliss will have a wait time of one year and 11 months, while Tampines Nova is expected to have a wait time of two years and eight months. For 122 two-room flexi flats in Tampines Nova, the demand was especially high, drawing 2,481 applicants. The application rate for first-timer singles was 111.4, which means that around 111 people are competing for each flat. The projects in Sembawang were less popular, despite being the only projects to offer five-room flat types this round. Both projects – Sembawang Deck and Sembawang Voyage – are classified as standard projects. There were 432 applicants for 662 five-room flats, and 637 applicants for 725 four-room flats. The application rates for first-timer families are 0.4 and 0.6 respectively. Three-room flats at Sembawang Deck had a slightly higher application rate, at 1.3 for first-timer families. In total, there were 220 applicants for 84 such flats. Sembawang Deck is a shorter waiting time project, with an expected wait time of two years and nine months. Mr Eugene Lim, the key executive officer at ERA Singapore, said the moderated response is likely reflective of Sembawang North’s status as an emerging estate , where amenities are still being developed. \"Moreover, with more flats scheduled to launch in Sembawang during June 2026’s BTO exercise, buyers may have seen little urgency to apply this round due to ample supply,\" he said. \"The BTO project in Woodlands slated for June may have also prompted buyers to hold off, given its location in a more attractive and mature town also in the north.\" While Bukit Merah is normally a popular estate due to its proximity to the city and status as a mature estate, its sole project in February had a “relatively lukewarm response”, said Mr Lim. Redhill Peaks, the only Prime project this round, drew 1,982 applicants for 593 four-room flats and 225 applicants for 91 three-room flats. The application rates for first-timer families were 2 and 0.7 respectively. Mr Lim said the measured demand could be due to the large number of BTO projects on offer in recent times, including the highly anticipated Berlayar Residences . “With such a high saturation of BTO supply in Bukit Merah recently, there could be (fewer) people in the market for a new home in the estate,” he said. He added that buyers who were unsuccessful in securing a unit in Berlayer Residences last October are likely to be waiting for the next opportunity in the same precinct, rather than applying for the current Redhill Peaks project. Meanwhile, Kim Keat Crest, a Plus project in Toa Payoh, recorded 967 applicants for 787 four-room flats and 152 applicants for 87 three-room flats. The application rates for first-timer families were 0.8 and 0.6 respectively. Ms Sun said the relatively low application rates suggest “some market saturation and slower demand” for the area. Earlier launches, such as Toa Payoh Ascent and Mount Pleasant Crest, had drawn stronger interest due to their proximity to the MRT station. However, Kim Keat Crest is primarily accessible by bus, she noted. Based on the Housing and Development Board’s (HDB) latest figures, the median application rate for three-room and bigger BTO flats among first-timer families stood at 0.8. That number is lower than the three BTO exercises in 2025, which saw rates of 1.1 for February, 1.4 for July and 1.9 in October. In a Facebook post on Wednesday evening, Minister for National Development Chee Hong Tat said: “As application rate is the number of applicants divided by the number of units available, a lower rate means higher chances of success for the applicants.” With application rates for first-timer families easing below one, and the median income of households rising above S$12,000 per month, it may be timely to consider adjusting the income ceiling for BTO upwards, Huttons’ Mr Lee said. In September last year, Senior Minister of State for National Development Sun Xueling said in parliament that the income ceiling for BTO flat buyers can be raised when the “right conditions are in place”. The BTO income ceiling was last revised in 2019. It is currently S$14,000 for couples and families. About 6,900 flats across Ang Mo Kio, Bishan, Bukit Merah, Sembawang and Woodlands will be offered in the June sales exercise. “HDB will continue to provide a robust supply of flats and a good mix of housing options for Singaporeans,” said Mr Chee.",
    "publication_date": null,
    "category": "Singapore",
    "scraped_at": "2026-02-11T23:18:07.187158"
  },
  {
    "url": "https://www.channelnewsasia.com/world/bmw-recall-potential-fire-hazard-cars-5923871",
    "title": "BMW recalls hundreds of thousands of cars over fire risk",
    "section": null,
    "subtitle": "World",
    "location": "FRANKFURT",
    "body_content": "The BMW brand logo can be seen on the BMW four-cylinder, the main administration building and landmark of the vehicle manufacturer BMW, in Munich, Germany, on Feb 4, 2025. BMW is recalling hundreds of thousands of cars due to a potential fire hazard, the German premium carmaker said on Wednesday (Feb 11). The global recall is affecting a mid-six-figure number of cars, a BMW spokesperson said. Newspaper Bild earlier reported on the recall, citing the Munich-based carmaker. Speciality publication kfz-betrieb said a total of 575,000 vehicles from various series are affected. BMW said that product inspections and customer complaints revealed that the starter motor in the identified vehicles could be defective, with an increase in wear and tear in the magnetic switch after a high number of starts, making it potentially harder or impossible to start the car. This carries the risk of causing a fire in the vehicle in the worst-case scenario, the spokesperson said.",
    "publication_date": null,
    "category": "World",
    "scraped_at": "2026-02-11T23:18:09.464427"
  },
  {
    "url": "https://www.channelnewsasia.com/singapore/pm-lawrence-wong-budget-2026-more-help-workers-5922566",
    "title": "More support measures for workers to be announced at Budget 2026: PM Wong",
    "section": null,
    "subtitle": "Singapore",
    "location": "SINGAPORE",
    "body_content": "The measures will help to address job concerns amid \"rapid technological change and a very uncertain external environment\", said Prime Minister Lawrence Wong. Singapore Prime Minister Lawrence Wong said that he would share more about the measures in his upcoming Budget statement on Feb 12, 2026. (Image: YouTube/Lawrence Wong) More support measures for workers will be unveiled during Singapore's 2026 Budget statement , Prime Minister Lawrence Wong said on Wednesday (Feb 11). These measures will help to address concerns over jobs, Mr Wong said in a video posted on YouTube. While Singapore's economy performed well last year and labour market conditions remain strong, job concerns continue to weigh on many workers amid \"rapid technological change and a very uncertain external environment\", said Mr Wong, who is also Finance Minister. \"The government will do more to support Singaporeans in navigating these changes,\" he said. \"And that includes helping you manage job transitions, equipping you with relevant skills to stay competitive and ensuring that all Singaporeans are able to secure good jobs with rising incomes.\" Mr Wong added that he would share more details on this in his upcoming Budget statement. In the video, Mr Wong spoke to two workers about their experiences at the workplace and listened to their suggestions on how Singapore's support system for workers can be improved. One of them was an engineer who had worked in the lift and escalator industry for more than 20 years, while the other was an educational therapist who switched careers after 17 years as a solutions consultant in the IT sector. \"We want to do more to support people like yourselves. I think in the time to come, given the rapid changes in technology and workplaces, I think people will have more career transitions,\" Mr Wong said to them, adding that work will evolve even if one remains in the same industry. \"We need to help Singaporeans continually upgrade themselves to stay relevant,\" Mr Wong said. Mr Wong will deliver the 2026 Budget statement in parliament at 3.30pm on Thursday. The statement will be broadcast live on Channel 5 and on radio via CNA938 and Capital 958. It will also be streamed on CNA and 8 World's website , YouTube, Facebook and TikTok pages. Mediacorp's meWATCH, the Ministry of Digital Development and Information's YouTube Parliament livestream , as well as the prime minister's own YouTube channel will also carry the statement. Updates from the Budget statement will be made on MOF's social media platforms. Once the Budget has been delivered, members of the public will also be able to view it on the Singapore Budget website .",
    "publication_date": null,
    "category": "Singapore",
    "scraped_at": "2026-02-11T23:18:11.615783"
  },
  {
    "url": "https://www.channelnewsasia.com/asia/malaysia-ron95-subsidy-foreigner-fuel-saving-5922881",
    "title": "Malaysia projected to save over US$600m in RON95 fuel subsidies for 2026: PM Anwar",
    "section": null,
    "subtitle": "Asia",
    "location": "KUALA LUMPUR",
    "body_content": "Prime Minister Anwar Ibrahim also expressed appreciation towards Malaysians' “vigilance” in reporting attempts by drivers of foreign-registered vehicles to purchase subsidised RON95. A man fuels his motorbike with RON95 petrol at a petrol station in Johor Bahru on Oct 17, 2024. Malaysia is projected to save at least RM2.5 billion (US$636.8 million) in RON95 fuel subsidies this year, Prime Minister Anwar Ibrahim said, as he doubled down on the government’s decision to maintain blanket subsidies for all locals in a more targeted way. “The government did not adopt the World Bank's recommendation - and that of some economists - to float fuel prices and only provide cash assistance to the poor,” Anwar told parliament on Wednesday (Feb 11). He added that if Malaysia followed the World Bank’s proposal, inflation would have spiked, further burdening the people. Malaysia's government previously spent RM20 billion a year on blanket subsidies for RON95 petrol, which Anwar had said unfairly benefitted top earners as well as foreigners. On Wednesday, he noted that the untargeted subsidies had also resulted in excessive leakages, including misuse and cross-border smuggling. This placed heavy pressure on public finances, and the government had no choice but to reform fuel subsidies.",
    "publication_date": null,
    "category": "Asia",
    "scraped_at": "2026-02-11T23:18:14.084743"
  },
  {
    "url": "https://www.channelnewsasia.com/asia/malaysia-tb-tuberculosis-johor-selangor-dzulkefly-ahmad-kota-tinggi-pontian-5922546",
    "title": "10 new TB clusters detected in Malaysia, with Johor recording highest number of cases",
    "section": null,
    "subtitle": "Asia",
    "location": "KUALA LUMPUR",
    "body_content": "New tuberculosis cases were also detected in six other states, according to Malaysia Health Minister Dzulkefly Ahmad. Malaysia Health Minister Dzulkefly Ahmad speaking to Parliament on Feb 10, 2025 on the latest TB clusters and measures taken. Malaysia has detected 10 new tuberculosis (TB) clusters across seven states as of last Saturday, with Johor recording the highest number of cases at 37, Health Minister Dzulkefly Ahmad said on Tuesday (Feb 10). The Johor cluster involves 29 children and eight adults. The first detected case in the cluster was traced to a 72-year-old female religious teacher in Kota Tinggi, reported local media. The remaining cases were identified through active testing and contact tracing by Health Ministry officers. TB is an airborne infectious disease caused by a bacterium called Mycobacterium tuberculosis. It most commonly affects the lungs but can affect almost any tissue or organ in the body, according to Singapore’s HealthHub portal. It can cause permanent lung damage if not treated early. Not everyone who is exposed to TB develops the illness. “As of Feb 7, we have identified 903 close contacts who went for TB screening. Symptomatic individuals were immediately treated at the Health Ministry facilities,” Dzulkefly told Parliament during Minister’s Question Time, as quoted by Bernama news agency. He was responding to a question from Kuala Langat Member of Parliament Ahmad Yunus Hairi on the latest status of TB clusters by state, the number of active cases under monitoring and measures in place to prevent further spread. Media outlets reported last week that at least six students were among those infected in the Kota Tinggi cluster.",
    "publication_date": null,
    "category": "Asia",
    "scraped_at": "2026-02-11T23:18:16.263511"
  },
  {
    "url": "https://www.channelnewsasia.com/asia/thailand-hat-yai-gunman-school-hostage-5923256",
    "title": "Gunman detained after entering southern Thai school, hostages freed, police official says",
    "section": null,
    "subtitle": "Asia",
    "location": "BANGKOK",
    "body_content": "The suspect entered the school demanding to see a specific teacher and upon not being able to find the person, the suspect shot a school staff member, according to an official. This photo released by the Royal Thai Police shows Thai police arresting a man at Patongprathankiriwat School in Hat Yai, Songkhla province, Thailand on Feb. 11, 2026. A gunman who fired shots at a school in Hat Yai district in southern Thailand on Wednesday (Feb 11) has been detained and all the people who were held hostage have been freed, a police official told Reuters. An 18-year-old man entered the Patongprathankiriwat School in Songkhla Province's Hat Yai earlier on Wednesday with a gun, the provincial administration said on social media. \"The perpetrator has been captured,\" Deputy Superintendent Wichian Soboon told Reuters, adding that two people - a student and a teacher - were wounded in the incident. \"Police shot the suspect in the Hat Yai shooting,\" Thailand's Central Investigation Bureau said in a statement, after earlier saying he had been killed.",
    "publication_date": null,
    "category": "Asia",
    "scraped_at": "2026-02-11T23:18:18.414262"
  },
  {
    "url": "https://www.channelnewsasia.com/world/russia-stick-new-start-treaty-limits-nuclear-arms-us-5923436",
    "title": "Russia says will stick to New START's nuclear arms limits as long as US does",
    "section": null,
    "subtitle": "World",
    "location": "MOSCOW",
    "body_content": "In this photo taken from a video released by Russian Defense Ministry Press Service on Oct 26, 2022, a Yars intercontinental ballistic missile is test-fired as part of Russia's nuclear drills from a launch site in Plesetsk, northwestern Russia. (Image: Russian Defense Ministry Press Service via AP) Moscow will observe the limits of the last nuclear arms pact with the United States that expired last week as long as it sees that Washington is doing the same, Russia's top diplomat said on Wednesday (Feb 11). The New START treaty expired on Feb 5, leaving no restrictions on the two largest atomic arsenals for the first time in more than half a century and fueling fears of an unconstrained nuclear arms race. Russian President Vladimir Putin last year declared his readiness to stick to the treaty’s limits for another year if Washington followed suit, but US President Donald Trump has argued that he wants China to be a part of a new pact - something Beijing has rejected . Speaking on Wednesday to the parliament's lower house, Russian Foreign Minister Sergey Lavrov said that even though the US has not responded to Putin's offer, Russia will respect New START's caps for as long as it sees that the US observes them too. “The moratorium declared by the president will remain as long as the US doesn't exceed these limits,” Lavrov told lawmakers. \"We will act in a responsible and balanced way on the basis of analysis of the US military policies.” He added that “we have reason to believe that the US is in no hurry to abandon these limits and that they will be observed for the foreseeable future”. “We will closely monitor how things are actually unfolding,\" Lavrov said. \"If our American colleagues’ intention to maintain some kind of cooperation on this is confirmed, we will work actively on a new agreement and consider the issues that have remained outside strategic stability agreements.\" Lavrov's statement followed a report by Axios claiming Russian and US negotiators discussed a possible informal deal to observe the pact’s limits for at least six months during talks last week in Abu Dhabi. Asked to comment on the report, Kremlin spokesman Dmitry Peskov said on Friday that any such extension could only be formal, adding that “it’s hard to imagine any informal extension in this sphere”. At the same time, Peskov confirmed that Russian and US negotiators discussed future nuclear arms control in Abu Dhabi where delegations from Moscow, Kyiv and Washington held two days of talks on a peace settlement in Ukraine. “There is an understanding, and they talked about it in Abu Dhabi, that both parties will take responsible positions and both parties realise the need to start talks on the issue as soon as possible,” Peskov said. New START, signed in 2010 by then-President Barack Obama and his Russian counterpart, Dmitry Medvedev, was the last of a long series of agreements between Moscow and Washington to limit their nuclear arsenals, starting with SALT I in 1972. New START restricted each side to no more than 1,550 nuclear warheads on no more than 700 missiles and bombers deployed and ready for use. It was originally set to expire in 2021 but was extended for five years. The pact envisioned sweeping on-site inspections to verify compliance, although they stopped in 2020 because of the COVID-19 pandemic and never resumed. In February 2023, Putin suspended Moscow’s participation, saying Russia could not allow US inspections of its nuclear sites at a time when Washington and its NATO allies openly declared they wanted Moscow’s defeat in Ukraine. But the Kremlin also emphasised it was not withdrawing from the pact altogether, pledging to respect its caps on nuclear weapons. In September, Putin offered to keep the New START’s limits for another year to buy time for both sides to negotiate a successor agreement. Even as New START expired, the US and Russia agreed on Feb 5 to re-establish high-level, military-to-military dialogue following a meeting between senior officials from both sides in Abu Dhabi, the US military command in Europe said. The link was suspended in 2021 as relations grew increasingly strained before Russia sent troops into Ukraine in February 2022.",
    "publication_date": null,
    "category": "World",
    "scraped_at": "2026-02-11T23:18:20.662649"
  },
  {
    "url": "https://www.channelnewsasia.com/world/switzerland-bar-owner-fire-fatal-questioned-lawyers-5923511",
    "title": "Swiss bar owner quizzed by lawyers over fatal inferno",
    "section": null,
    "subtitle": "World",
    "location": "SION",
    "body_content": "Co-owner of Le Constellation bar Jacques Moretti (left) and Jessica Moretti arrive to attend a hearing at the Office of the public prosecutor of the Canton of Valais as part of the inquiry into a devastating New Year's fire in Sion on Feb 11, 2026. Jacques Moretti, co-owner of the Swiss bar engulfed in a fatal blaze during New Year celebrations, was questioned Wednesday (Feb 11) by lawyers representing victims' families, seeking answers on how many partygoers were allowed inside. Moretti and his wife, Jessica, co-own Le Constellation in the ski resort of Crans-Montana, where a devastating fire killed 41 people and injured 115 others on Jan 1. The French couple made no comment as they arrived hand-in-hand for the hearing in the nearby city of Sion. The Morettis are under criminal investigation, facing charges of manslaughter by negligence, bodily harm by negligence and arson by negligence. Jessica Moretti is due to be questioned on Thursday. \"I hope answers will be provided. We hope to better understand what happened and establish responsibilities,\" Nicolas Mattenberger, a lawyer representing victims' families, told reporters outside. Those killed were mostly teenagers, while most of the injured remain in various hospitals across Switzerland and Europe . Most of those caught up in the inferno were Swiss, but a total of 19 nationalities were among those killed and wounded, including nine French and six Italian nationals. Leila Micheloud, the mother of two daughters injured in the fire, attended Wednesday's hearing. \"It's a path to healing. We're waiting for answers, the truth, for them to tell the truth; we're not asking for anything more,\" she told journalists. \"We're in a battle. I have to be here. \"When you have two of your children who almost died, you're not afraid of anything,\" she added. Wednesday's and Thursday's interviews \"are intended to allow the lawyers for the civil parties to ask the questions they were unable to ask\" during previous hearings, the Wallis canton's public prosecutor's office said on Monday. The Morettis' lawyer, Yael Hayat, told reporters outside that the hearings would be the first time the couple would be able to speak directly to the lawyers representing the victims and families. \"They are empathetic, but at the same time, they are isolated. It is also very difficult for them not to be able to express themselves directly, since the legal proceedings require that there be no contact,\" Hayat said. Twenty of those killed in the fire were under 18, including the six Italian fatalities. Fabrizio Ventimiglia, an Italian lawyer, said he was \"expecting important answers\" not only on security at the bar but also on \"the number of people present\" when the fire broke out, and regarding \"the sale of alcohol to minors\". The Wallis public prosecutor's office said Monday that around 50 orders and warrants had been issued in the case, and more than a dozen hearings conducted so far. The case file \"comprises nearly 2,000 pages and includes more than 8,500 physical documents; 263 civil parties have been identified and are represented by 74 lawyers\", it said. In Crans-Montana, the makeshift memorial for victims of the blaze caught fire itself on Sunday, due to candles left burning inside. A white, igloo-like tarpaulin had been erected over the candles, flowers and messages to shield them from the snow and winter weather. Candles have now been banned from the memorial, while the book of condolence, saved from the fire, is now inside a nearby chapel. The Swiss government decided Wednesday that the victims and their families should receive a \"solidarity contribution\" from the state, to help meet their costs.",
    "publication_date": null,
    "category": "World",
    "scraped_at": "2026-02-11T23:18:22.903549"
  },
  {
    "url": "https://www.channelnewsasia.com/sport/thomas-frank-tottenham-hotspur-manager-sacked-english-premier-league-5923116",
    "title": "Tottenham Hotspur sack manager Thomas Frank with relegation dogfight looming",
    "section": null,
    "subtitle": "Sport",
    "location": "LONDON",
    "body_content": "Thomas Frank during the English Premier League match between Tottenham and Newcastle in London, Feb 10, 2026. Tottenham Hotspur have sacked manager Thomas Frank after nine months in charge, the Premier League club said on Wednesday (Feb 11), after a woeful run of results left the north London club hovering five points above the relegation zone. Pressure on Frank had been mounting, and Tuesday's 2-1 home defeat by Newcastle United left his team in 16th place with 29 points from 26 matches and looking over their shoulder at the relegation zone. \"Thomas was appointed in June 2025, and we have been determined to give him the time and support needed to build for the future together,\" Spurs said in a statement. \"However, results and performances have led the Board to conclude that a change at this point in the season is necessary.\"",
    "publication_date": null,
    "category": "Sport",
    "scraped_at": "2026-02-11T23:18:25.052770"
  },
  {
    "url": "https://www.channelnewsasia.com/singapore/gdp-ai-trade-manufacturing-economy-5919481",
    "title": "CNA Explains: What's driving Singapore's exceptional economic growth, and can it last?",
    "section": null,
    "subtitle": "Singapore",
    "location": "SINGAPORE",
    "body_content": "Singapore's economy has grown above 5 per cent for two consecutive years – a feat last achieved in 2010 and 2011. People walking in Raffles Place in Singapore. Despite government projections that economic growth would slow as Singapore's economy matures, the country has defied expectations for two consecutive years. In 2025, Singapore's economy expanded 5 per cent , exceeding forecasts even after the Ministry of Trade and Industry (MTI) upgraded its projections twice – in August and November. The year before, growth hit 5.3 per cent. This marks the first time since 2010 and 2011 that Singapore has sustained annual growth above 5 per cent for two straight years. On Tuesday (Feb 10), MTI raised its 2026 forecast to between 2 and 4 per cent, up from the previous forecast of 1 to 3 per cent. CNA examines what drove this exceptional performance and whether Singapore can maintain its momentum. MTI attributed 2025's robust GDP expansion primarily to manufacturing, wholesale trade, and finance and insurance sectors. The electronics cluster and machinery, equipment and supplies segment experienced particularly strong growth, driven by surging demand for artificial intelligence-related electronics. Accommodative financial conditions supported growth in the finance and insurance sector. Ms Selena Ling, chief economist and head of group research at OCBC, highlighted \"very broad-based sectoral growth\", citing robust foreign direct investment and safe haven capital inflows into Singapore. Beyond semiconductors, construction remained resilient with strong public and private sector pipelines, while pharmaceuticals also contributed significantly, she added. Singapore also benefited from \"competitively lower\" tariffs on exports to the United States compared to other Southeast Asian economies, Ms Ling noted. Standard Chartered economists said relatively benign global monetary and fiscal conditions, robust AI-related demand, tariff truces and lower effective tariff rates likely combined to boost economic activity. Economists agreed that Singapore's GDP performance over the past two years has been exceptional for a developed economy. In recent history, Singapore has only recorded such high growth rates when recovering from major crises, said Ms Lee Yen Nee, senior country risk analyst at BMI Research. \"Last year, this growth rate was achieved without a preceding crisis, and it was almost entirely driven by the global capital spending on AI,\" she said, adding that while electronics manufacturing benefitted most, spillover effects reached services sectors involved in goods movement. Ms Sheana Yue, senior economist at Oxford Economics, called it \"particularly exceptional\" that Singapore's economy expanded by 5 per cent despite \"heightened external challenges amid US tariff hikes\". In April last year, MTI downgraded its GDP forecast to between 0 and 2 per cent on fears that US tariffs would severely impact Singapore. Ms Lee said Singapore appeared largely shielded because semiconductors, pharmaceuticals and many high-tech products remained exempt from tariffs. \"Singapore’s high exposure to these areas means that the economy is largely shielded. Furthermore, Singapore benefitted from the flurry of front-loading activity to beat the implementation of higher US tariffs,\" she added. Several Asian economies also recorded strong growth in 2025, economists noted. Taiwan's economy grew 8.63 per cent – its fastest pace in 15 years – while Malaysia's advance estimates indicated 4.9 per cent growth. \"The main driver was exports and investment related to electronics, AI in particular,\" said Ms Yue, describing Taiwan and Malaysia's performance as \"stunning\". The surge in demand for AI products, coupled with tariff-related front-loading, benefited the wider Asian region where high-end chips are produced, she said. Ms Yun Liu, senior ASEAN economist at HSBC, pointed out that Singapore's growth was almost the same as what Indonesia reported, and that Vietnam grew around 8 per cent. Singapore initially underestimated AI-related electronics demand, acknowledged Ms Yong Yik Wei, chief economist at MTI, during a media briefing on Tuesday. \"We underprojected because it's quite a nascent technology, and it's quite hard to get the exact trajectory with a high level of precision. So on hindsight, we did underproject that strength in the AI demand,\" she said in response to CNA's question about the ministry's two forecast upgrades last year. That demand created positive spillover effects into related sectors such as wholesale trade, she added. Tuesday's forecast upgrade takes into account \"sustained momentum\" in AI investment, aligning with the Economic Strategy Review committees' recommendations for Singapore to establish itself as a global AI leader . MTI also underestimated pharmaceutical output due to unexpectedly large production of a high-value active pharmaceutical ingredient, Ms Yong said. \"It's actually quite difficult to forecast pharma output because it's quite volatile because of the nature of the production process,\" she said. Analysts caution that maintaining similar growth in 2026 will be challenging, particularly given 2025's high baseline. \"If Singapore’s AI hub ambitions can materialise, then it is possible to see slightly better-than-expected growth potentially exceeding 3 per cent ... but 5 per cent may be a bit of a stretch,\" said Ms Ling of OCBC. Ms Yue of Oxford Economics pointed to emerging slowdown signs, noting fourth-quarter GDP growth declined from the third quarter. External sector risks, uneven domestic activity and a softening labour market could weigh on private consumption momentum, she added. However, the Singapore Economic Development Board (EDB) remains optimistic about AI's prospects. \"One of the strengths for Singapore is really in our industry verticals. We have various strengths in key sectors, for example, semiconductors, in electronics, in healthcare and so on, that provides for that fertile ground for AI (application),\" said Ms Jillian Lim, executive vice-president at EDB. With leading tech companies establishing operations in Singapore, she expects AI to remain an important growth area. \"We do expect that AI will be a key pillar and a growth area for us that will sustain,\" she said.",
    "publication_date": null,
    "category": "Singapore",
    "scraped_at": "2026-02-11T23:18:27.261927"
  }
]